NextFOAM-2401/tutorials/incompressible/pimpleFoam/RAS/ellipsekkLOmega/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.1 0 0);

boundaryField
{
    outlet
    {
        type             inletOutlet;
        inletValue       uniform (0 0 0);
        value            uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (3.1 0 0);
    }

    up
    {
        type            symmetry;
    }

    hole
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
