NextFOAM-2401/tutorials/incompressible/pimpleFoam/RAS/ellipsekkLOmega/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type           calculated;
        value          uniform 0;
    }

    outlet
    {
        type           calculated;
        value          uniform 0;
    }

    up
    {
        type           symmetry;
    }

    hole
    {
        type           nutLowReWallFunction;
        value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
